 <div class="row">
        <div class="col-lg-9">
 <h1>176.Second Highest Salary</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Write a SQL query to get the second highest salary from the <code>Employee</code> table.</p>

<pre>
+----+--------+
| Id | Salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
</pre>

<p>For example, given the above Employee table, the query should return <code>200</code> as the second highest salary. If there is no second highest salary, then the query should return <code>null</code>.</p>

<pre>
+---------------------+
| SecondHighestSalary |
+---------------------+
| 200                 |
+---------------------+
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
Employee = pd.read_sql_table("Employee4", engine)
Employee

   Id  Salary
0   1     100
1   2     200
2   3     300

In [3]:
query = '''
SELECT IFNULL(( 
SELECT DISTINCT Salary 
FROM Employee4
ORDER BY Salary DESC
LIMIT 1 OFFSET 1), NULL)SecondHighestSalary;
'''
pd.read_sql_query(query, engine)

   SecondHighestSalary
0                  200

## Note:
# Time:  O(n)
# Space: O(1)
#### 1. SELECT IFNULL([VALUE], NULL);
#### 2. LIMIT N OFFSET M --> print N records with M offset.
#### 3. ORDER BY, default ascending.